{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/dynamictrees",
  "1.18.2": {
    "1.18.2-1.0.2": "Fixes:\n- Fixed forest staff creating doubled ghost block trees\nChanges:\n- Allowed for custom trees that require silktouch for their drops to desplay it on the waila handler",
    "1.18.2-1.0.1": "Fixes\n+ Fixed crash in servers",
    "1.18.2-1.0.0": "At last, the official 1.0 update is out!\n\nNew Features:\n\n+ Cocoa species\n\n+ Falling tree sound effects\n\nChanges:\n\n+ Jungle undergrowth leaves are now dynamic bushes\n\n+ Extended reach of staff item for placing trees\n\n+ Internal changes\n\n+ minor changes to conifer growthlogic\n\n+ fruits and pods now show up in waila hud\n\nFixes:\n\n- fixed seasonal titles not showing up properly with some season handler mods\n\n- fixed bamboo getting cut by mega jungle trees\n\n- fixed air pockets with trees that generate underwater\n\n- other minor fixes",
    "1.18.2-0.11.0-Beta6": "### Enhancements\n- Biome populator selectors can now filter by biome tags. \n\n### Changes\n- Feature cancellers are now read from a separate file called `feature_cancellers.json` rather than from the default populators.*\n- Added rooty dirt as the snow block\u0027s substitute soil.\n\n### Bug Fixes\n- Fix some broken resource loading error messages.\n- Fix spruce trees spawning in frozen oceans and ice spikes biomes.\n- Fix loading error with Patchouli book.\n\n* Due to this change, **any add-ons using feature cancellers will need to be updated**. Therefore, it is recommended that you ensure all add-ons are fully up-to-date. Those maintained under the `DynamicTreesTeam` GitHub have been updated and released alongside this.",
    "1.18.2-0.11.0-Beta5": "### Changes\n- Base ground finder on DimensionType#hasCeiling rather than DT biome database.\n- Modify chance for nether forests to 1.\n\n### Bug Fixes\n- Fix loading issue (#737).",
    "1.18.2-0.11.0-Beta4": "Small patch fixing crash when looking at apples and dynamic trees with cocoa beans in multiplayer (#732, #734).",
    "1.18.2-0.11.0-Beta3": "Fix branch item names not having `_branch` suffix.",
    "1.18.2-0.11.0-Beta1": "Ported 1.16.5 fixes and updates (see 1.16.5-0.10.0-Beta34 for details).",
    "1.18.2-0.11.0-Alpha2": "### Bug Fixes:\n- Fix biomes randomly not generating trees.\n- Fix rooty block rendering.\n- Fix tree not having a common species sapling block.\n- Other minor fixes.",
    "1.18.2-0.11.0-Alpha1": "### Initial port of 1.18\nThis version still lacks many features, such as the azalea trees.\n\n### Changes:\n- Added moss, rooted dirt and snow blocks as valid soils.\n\nMassive thanks to Nyfaria and SizableShrimp for doing all of the heavy lifting for this port!",
    "1.18.2-0.11.0-Beta7": "- Fix small mistake in TreeHelper#destroyTree [Harley]\n- Add TreeHelper#destroyTree for easier mod integration [Harley]\n- Set project name to \"Dynamic Trees\" [Harley]"
  },
  "1.16.5": {
    "1.16.5-0.10.5": "Fixes:\n- Fixed oak trees spawning in places they shouldn\u0027t\nTechnical:\n- Updated seed class to allow for cleaner inheritance",
    "1.16.5-0.10.2": "Small patch fixing crash when looking at dynamic trees with cocoa beans in multiplayer (#734).",
    "1.16.5-0.10.1": "Small patch fixing crash when looking at apple trees in multiplayer (#732).",
    "1.16.5-0.10.0": "Release, no changes from beta 35.",
    "1.16.5-0.10.0-Beta35": "Small patch re-enforcing the minimum seasonal drop chance of 15%.",
    "1.16.5-0.10.0-Beta34": "### Enhancements\n- Make fruits and pods data-driven.\n- Add `TransitionSaplingToTreeEvent` event.\n- Rework drops to use loot tables.\n- Many more minor code changes/refinements.\n\n### Fixes\n- Fix vanilla trees spawning in villages.\n- Fix trees sometimes spawning before structures.\n- Fix model incompatibility with Sodium Forge ports.\n- Fix substitute soil, and hence remove rooty farmland’s uninentional existence.\n- Fix noise density for Poisson radius selection.\n- Fix purge tree command not cleaning up related attached blocks.\n- Other minor fixes.",
    "1.16.5-0.10.0-Beta33": "### Enhancements\n- Changed rooty blocks to use getSoilBlockstate for shape, light, and all other properties instead of default blockstate.\n- Changed `getHarness` method to include the blockState parameter for `BlocksWithDynamicHardness` (some addons might need updating)\n- Added `isValidBranchBlock` method to `Family` class.\n- Added some nether plants to the foliage tag.\n- General datapack improvements.",
    "1.16.5-0.10.0-Beta32": "### Bug Fixes\n- Prevented client crash when secondary leaves are not fetched properly.\n- Fixed `names_or` applier not working properly.",
    "1.16.5-0.10.0-Beta31": "##### Enhancements:\n- Add item tags for bone meal and growth effect.\n\n##### Bug Fixes:\n- Fix bush feature only placing leaves if secondary leaves are set.",
    "1.16.5-0.10.0-Beta30": "##### Bug Fixes:\n- Fixed mushroom models being tinted.\n- Fixed deserialisation of materials, material colors, and sound types in production environment.\n- Fixed crash when breaking sapling on client connected to remote server due to required Species data not being loaded.",
    "1.16.5-0.10.0-Beta29": "Enhancements:\n- Added error message for missing sapling item in seed-sapling recipes.\n- Made logging more consistent in certain areas.\n\nChanges:\n- Refactored `leafAges` -\u003e `AgeingConfiguration` and `does_age` leaves leaves properties property to `ageing_configuration` to match.\n\nBug Fixes:\n- Fixed crash due to bush feature not respecting nullable secondary leaves property.",
    "1.16.5-0.10.0-Beta28": "Bug Fixes:\n- Fixed crash on server startup due to client-only method.",
    "1.16.5-0.10.0-Beta27": "New Features:\n- Growth Logic Kits now have properties. These are work in the same way as those used by gen features and drop creators.\n\nEnhancements:\n- Global drop creators can now be defined in the `drop_creators/global` subfolder (relative to `trees/[namespace]`).\n- Gen Features, Drop Creators, and Growth Logic Kits can now have configurations defined in their own file (`gen_features/configurations`, `drop_creators/configurations`, and `growth_logic_kits/configurations` respectively, relative to `trees/[namespace]`).\n- A lot of code cleanup and refactors.\n- Reworked Json deserialisation, error and warning logging should be much more thorough now.\n- Added `NOT` operator to Json biome selectors.\n- `Configurable#get` is now non-null (calling on a null property causes a crash).\n\nBug Fixes:\n- Fixed root blocks not connecting properly underwater.\n- Fix incorrect check causing leaves to force chunk loading (port of #646).\n\nPlease note that the following add-ons will need an update due to the code changes in this version. They have each been released simultaneously and so should be uploaded by the time you\u0027re reading this. \n- DT+\n- DT Atum 2\n- DT BOP\n- DT BYG\n- DT Nature\u0027s Aura\n- DT Neapolitan",
    "1.16.5-0.10.0-Beta26": "New Features:\n+ Added `\"OR\"` and `\"AND\"` appliers to datapack worldgen biome selectors.\n+ Added `\"names_or\"` applier to datapack worldgen biome selectors.\n+ Allowed rooty soils to read blockstate of primitive soil for checking validity and deciding the proper soil block to use.\n\nEnhancements:\n- Moved generateDirtBucketRecipes to common config\n\nBug Fixes:\n- Fixed logs and sticks dropping above the max stack size.\n- Fixed substitute soils not assigning properly",
    "1.16.5-0.10.0-Beta25": "New Features:\n+ Added block state, block model, and item model generators.\n\nEnhancements:\n+ Accept `shears` ToolType rather than relying on type-bound `ShearsItem` detection.\n- GrowthLogicKit.newDirectionSelected now takes `World` and `BlockPos` parameter.\n- Shrunk falling tree entity bounding box to reduce lag (culling bounding box is kept large to prevent it disappearing at a distance).\n\nBug Fixes:\n- Fixed crash whilst generating vines (#618).\n- Fixed CME whilst exploding a large amount of trees (#620).\n- Fixed pathfinding issues around dynamic trees (#592).\n- Fixed world ticking exception with SnowRealMagic (#617).",
    "1.16.5-0.10.0-Beta24": "New Features:\n+ Added mega jungle trees to jungle biomes\n+ Added alternativeLeavesGenFeature\n+ Added randomPredicateGenFeature\nEnhancements:\n- Removed vanilla leaves connecting to dynamic trees\n- Reverted growPulse command to work instantly again\nBug Fixes:\n- Fixed palm type trees not rendering correctly sometimes\n- Fixed trunk shell blocks sometimes staying behind when chopping down thick trees",
    "1.16.5-0.10.0-Beta23": "Enhancements:\n- Built-in integration with Better Weather seasons.\n- `preferredSeasonMod` config option for selecting which season provider should be used.",
    "1.16.5-0.10.0-Beta22": "Bug Fixes:\n- Fixed NoSuchElementException when generating a conifer topper.",
    "1.16.5-0.10.0-Beta21": "Bug Fixes:\n- Fixed secondary leaves chance property not being registered to bush gen feature.",
    "1.16.5-0.10.0-Beta20": "Bug Fixes:\n- Fixed crash whilst generating bush gen features.\n- Fixed silk touch not dropping leaves.\n- Fixed absent wart block drops.\n\nTree Pack Changes:\n- Weighted drop type now uses WeightedList.\n- Added `secondary_leaves_chance` property to bush gen feature.",
    "1.16.5-0.10.0-Beta19": "Bug Fixes:\n- Fixed crash with DT Traverse due to bush gen features not having a default property value.\n\nTree Pack Changes:\n- Added `can_craft_sapling_to_seed` and `can_craft_seed_to_sapling` properties to Species for individual control over automatically generated recipes.",
    "1.16.5-0.10.0-Beta18": "New Features:\n- Soil blocks are now defined through Tree Packs.\n- Drop creators are now defined through Tree Packs, allowing customization of tree drops.\n- Updated Patchouli manual to 2nd edition.\n\nBug Fixes:\n- Fixed threading issue due to some modded dimensions being generated on alternate threads.\n- Various minor bug fixes.",
    "1.16.5-0.10.0-Beta17": "New Features:\n- Tree branches can now be waterlogged.\n- Surface roots can now be waterlogged.\n- Added Block and Item tag generators for addons.\n\nTree Pack Changes:\n- Added `fire_proof` property to families.\n- Added `max_signal_depth` property to families.\n- Added `can_grow_on_ground` property to leaves_properties.\n- Added `sapling_name` property to species.\n- Added `seed_name` property to species.",
    "1.16.5-0.10.0-Beta16": "Bug Fixes:\n- Fixed tree pack loading order.",
    "1.16.5-0.10.0-Beta15": "Enhancements:\n+ The burgeoning potion now fills fertility when used and persists until fertility depletes instead of running on a timer.\n+ Bone meal now restores two points of fertility on application.\n+ Added many new custom tags and better integration with vanilla tags. Details can be found here: https://github.com/ferreusveritas/DynamicTrees/wiki/Tags.\nChanges:\n- Disabled persistence and fertility potions, will be removed entirely in the next version.\n- Beehives are now slightly rarer in forests.\nTechnical Changes:\n- Certain species location overrides will now require a separate sapling block to function (to fix crash with Minecolonies).\n- Json biome selectors can now filter biomes by their category.\n- Json block property appliers can edit the light block property to make blocks like leaves emit light.\n- Branch model loaders now automatically default to a thick branch model if the family\u0027s maximum branch radius is greater than 8.\n- Added Palm species type, leaves properties, and growth logic (for add-ons to access, there are no palm trees in base DT).\nBug Fixes:\n- Fixed crash with Minecolonies.\n- Fixed harvest multiplier being ineffectual to log drops.\n- Fixed dynamic leaves dropping primitive leaves when broken without shears.\n- Fixed dynamic birch leaves colours not being changed by serene seasons.",
    "1.16.5-0.10.0-Beta14": "Bug Fixes:\n- Fixed density selectors - forests should now be as dense as they were in 1.12. \n- Fixed trees not spawning in modified wooded badlands.\n- Fixed loot tables support for certain blocks (temporary until drop creators are made). \n- Fixed not clearing model caches which caused a memory leak.",
    "1.16.5-0.10.0-Beta13": "Enhancements:\n- Added config option for whether or not the player can bone meal a tree.\nBug Fixes:\n- Fixed commands not being registered on server reload, meaning they would disappear. \n- Fixed trunk shell hardness bug. \n- Fixed trunk shell not disappearing on neighbour update.\n- Fixed potted dynamic sapling consuming items in creative mode. \n- Fixed bug where tree generation would be cancelled by grass or ferns. ",
    "1.16.5-0.10.0-Beta12": "Enhancements:\n- Updated lang files for spanish and french\nBug Fixes:\n- Fixed thick logs being transparent",
    "1.16.5-0.10.0-Beta11": "Enhancements:\n- Error logging and language improvements\n- Added bare cell kit for use in addons\n- Other minor improvements\nBug fixes:\n- Fixed season seed labels being incorrectly assigned\n- Prevented bee nests from filling forests over time\n- Other minor fixes",
    "1.16.5-0.10.0-Beta10": "Enhancements:\n- Internal changes to tree fall animation for extra add-on capabilities. \nBug Fixes:\n- Fixed vanilla tree cancellers.",
    "1.16.5-0.10.0-Beta9": "Enhancements:\n+ Create\u0027s tree fertiliser now gives the same effect as a burgeoning potion.\n- Updated Spanish translation [translated by Jorgegiral].\n- Updated Mexican Spanish translation [translated by EdicionGamerYT].\nBug Fixes:\n- Fixed apple trees not spawning in world gen (due to absent JoCodes). \n- Fixed two config options having the same ID, making configuration of seed drops rates inaccessible. \n- Fixed potted sapling not having a localisation.",
    "1.16.5-0.10.0-Beta8": "Enhancements:\n+ Added rooty terracotta. \n+ Rooty blocks can now use custom colour multipliers.\n+ Added localisations for staff tooltips. \n- Updated French translation [translated by @19PixelsPlaced]\n+ The trunk shell block can now be waterlogged. \nTree Packs:\n- Improvements to how tree packs are reloaded.\n+ The registry name of the generated leaves block can be changed in the leaves properties Json via block_registry_name. \n+ Additional \"valid\" leaves can now be added to the species Json via valid_leaves. \nBug Fixes:\n- Fixed an ArrayIndexOutOfBoundsException with the tree falling animation.\n- Fixed CraftTweaker incompatibility. \n- Fixed an issue where primitive logs and sticks couldn\u0027t be found from other mods.",
    "1.16.5-0.10.0-Beta7": "Enhancements:\n- Added Polish translation. [PR from SubcarpathianSkull]\n- Added soil life argument to /dt settree.\n- Improved nether worldgen\nBug Fixes:\n- Fixed trees being unbreakable in multiplayer servers\n- Fixed crashes related to ConcurrentModificationExcpetions.\n- Fixed dynamic tree configured feature not being registered properly.",
    "1.16.5-0.10.0-Beta6": "Initial 1.16.5 beta for CF."
  },
  "1.12.2": {
    "1.12.2-0.9.29": "##### Bug Fixes:\n- Fixed update tracker not working",
    "1.12.2-0.9.28": "##### New Features:\n- Added BoneMealHelper to manage new bonemeal-like items",
    "1.12.2-0.9.27": "##### Bug Fixes:\n- Fix incorrect check causing leaves to force chunk loading.\n- Fixed trees consuming all potion items if they\u0027re stackable.",
    "1.12.2-0.9.26": "Changes:\n- Bumped minimum Forge version to 14.23.5.2860.\n\nBug Fixes:\n- Fixed arrows shot at dynamic leaves floating.",
    "1.12.2-0.9.25": "Enhancements:\n- Added action bar error messages to certain common potion application failures.\n- Shrunk falling tree entity bounding box to reduce lag (culling bounding box is kept large to prevent it disappearing at a distance).\n\nBug Fixes:\n- Fixed incompatibility with SnowRealMagic that caused \"ghost blocks\" to spawn on trees in place of snow layers.\n- Fixed log spam `X not valid leaves for Y.` due to not checking leaves are valid before destroying.\n- Fixed crash when using name array selector in worldgen Json.\n- Fixed potions only being consumed if they used lingering effects.\n- Fix incompatibility crash with Hardcore Item Stages.",
    "1.12.2-0.9.24": "New Features:\n- Added tall birch species, generates in the mutated birch forest.\n- Added Mega Jungle species to world gen.\n- Added not operator for name selectors in Json biome database populators.\n- Added array name selector in Json biome database populators.\n\nEnhancements:\n- Bone meal restores two points of fertility (up from one point).\n- Added config option for how many growth pulses bone meal sends.\n- The burgeoning potion restores all fertility and then speeds up growth until fertility runs out instead of running on a timer.\n- Families can now customise max signal depth without having to create a new BranchBlock.\n- Added Polish translation. [by SubcarpathianSkull]\n- Optimised assets. [by RDKRACZ]\n\nChanges:\n- Effectively removed fertility and persistence potions (no longer obtainable, ones previously crafted will still exist).\n\nBug Fixes:\n- Fixed biome selector blacklist checking for all match instead of any match.\n- Fixed crash with falling tree physics.\n- Fixed dynamic leaves not dropping when broken with silk touch.\n- Fixed incompatibility with Jurassicraft that caused missing texture blocks to spawn in place of vines.",
    "1.12.2-0.9.23": "New Features:\n- Added functionality for the type selector to negate biomes using \u0027!\u0027 in JSON worldgen.\nEnhancements:\n- Added validLeavesBlocks and validBranches system to trees allowing Addons to configure multiple blocks to be rendered during tree felling animation. (Back-ported from 1.16.5)\n- Added colorTreeQuads method on species to allow Addons to customize the coloring of tree quads.\n- Added showSpeciesOnWaila method on Species to allow addons to toggle the waila display if needed. (Back-ported from 1.16.5)\n- Added Waila display handler for rooty water blocks.\n- Added setMegaSpecies mehtod on species class to allow Addons to add Mega variants to existing species. (Back-ported from 1.16.5)\nBugs Fixed:\n- Added dimensionForceGeneration predicate to fix an issue where sky-like dimensions would not generate trees under certain circumstances.",
    "1.12.2-0.9.22": "New Features:\n- Added /dt transform for transforming tree species.\n- Added /dt createtransformpotion for spawning in transformation potions.\n- Added localisations for potion descriptions, season tooltips, and staff tooltips.\n- Added config options for disabling components of seasons compatibility.\nEnhancements:\n- Transformation potions recipes for add-ons trees are now auto-created.\n- Updated the Patchouli guide book with fixes and new pages.\n- Updated various localisation files. [PRs from Smollet777]\nBug Fixes:\n- Fixed incompatibility for Pyrotech’s extra stick drops.\n- Fixed Barretone bot crash. [PR from C0bra5]\n- Fixed tinker’s construct mattock not taking custom damage.\n- Fixed certain commands not working when targeting a thick branch.\n- Fixed Mekanism flamethrower crash.",
    "1.12.2-0.9.21": "New Features:\n- Make season manager position sensitive for more complex climate models(such as TFC)\nBug Fixes:\n- Fix species for location saplin transition problem(only affects certain add-ons)\n- Re-add deprecated function for compatibility with primitive mobs\n- Re-add deprecated addAcceptableSoil as an empty function for compatibility with underground biomes\n",
    "1.12.2-0.9.20": "New Features:\n- Greatly improve resistance to rare distorted tree models during worldgen\n- Enhanced rooty dirt mimic capabilities with new DirtHelper system\n- Admin commands to remove trees from chunks or clean up orphaned nodes\nBug Fixes:\n- Fix Tooltip crash\n- Fix nether generation density issues for add-on mods\nInternal:\n- Removed some deprecated methods\n",
    "1.12.2-0.9.19": "New Features:\n-Add support API functionality for Add-ons\n Bug Fixes:\n-Fixed stack overflow crash",
    "1.12.2-0.9.18": "New Features:\n- Created soil registry system.",
    "1.12.2-0.9.17": "New Features:\n- API support for new Dynamic Trees PHC Add-on feature.",
    "1.12.2-0.9.16": "New Features:\n- Add alternative snow layer block that forms on leaves(disabled by default) for the purpose of shader waving or custom models.\n- Add config option for giant mushrooms spawning in roofed forests (enabled by default).\n- Internal API additions for add-ons.\n\nBugs Fixed:\n- Transformations potions are not consumed if the target species already matches the potion species.\n- Add checks to prevent runaway mimic recursion causing a client side crash under rare circumstances.",
    "1.12.2-0.9.15": "New Features:\n- Added patchouli manual.\n- Added forge mod update checking.\n\nBugs Fixed:\n- Fixed concurrent modification exception crash during block breaking.\n- Fixed concurrent modification exception crash during multiple explosions.\n- Fixed \"perma-shrub\" bug that occured if doDayLightCycle was false.",
    "1.12.2-0.9.14": "New Features:\n- Removed \"Dynamic\" prefix from localized branch names.\n- Species name localizations (please be patient while add-ons catch up, species names will be unlocalized until new add-on releases are made with updated lang files).\n\nBugs Fixed:\n- Dimensions other than 0 now grow trees properly again (bug introduced by Serene Seasons integration effort).\n- Made rooty dirt blocks get color from mimic instead of grass (thanks Max Hyper).\n- Fix optifine shader interaction bug where sky could be seen through breaking texture on trees.\n- Fixed small crash with cactus model (thanks Max Hyper).\n\nInternal:\n- Enhanced SeasonHelper capabilities with helper functions.\n- Removed \"Wrapped\" classes and redefined blockstate files to be more standard.\n- Don\u0027t throw an exception when a JoCode file isn\u0027t defined."
  },
  "promos": {
    "1.18.2-latest": "1.18.2-1.0.2",
    "1.18.2-recommended": "1.18.2-1.0.2",
    "1.16.5-latest": "1.16.5-0.10.5",
    "1.16.5-recommended": "1.16.5-0.10.5",
    "1.12.2-latest": "1.12.2-0.9.29",
    "1.12.2-recommended": "1.12.2-0.9.29",
    "1.19.2-latest": "1.19.2-1.1.0-BETA4",
    "1.19.2-recommended": "1.19.2-1.1.0-BETA4"
  },
  "1.19.2": {
    "1.19.2-1.1.0-BETA4": "- Bump to BETA 4, fix auto update tool [Harley]\n- Fix burgeoning potion not lingering [Harley]\n- Change version type to beta [Harley]"
  }
}